seanmlyons22/ti-lprf-pacs/svds/cc13x2_cc26x2.svd
        <register>
          <name>EVENT</name>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <description>Event</description>
          <fields>
            <field>
              <name>RESERVED6</name>
              <description>[31:6] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>26</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>TEMP_UPDATE</name>
              <description>[5:5] Alias to TEMPUPD.STAT</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>BATT_UPDATE</name>
              <description>[4:4] Alias to BATUPD.STAT</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>TEMP_BELOW_LL</name>
              <description>[3:3] Read:
1: Temperature level is below the lower limit set by TEMPLL.
0: Temperature level is not below the lower limit set by TEMPLL.
Write:
1: Clears the flag
0: No change in the flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>TEMP_OVER_UL</name>
              <description>[2:2] Read:
1: Temperature level is above the upper limit set by TEMPUL.
0: Temperature level is not above the upper limit set by TEMPUL.
Write:
1: Clears the flag
0: No change in the flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>BATT_BELOW_LL</name>
              <description>[1:1] Read:
1: Battery level is below the lower limit set by BATTLL.
0: Battery level is not below the lower limit set by BATTLL.
Write:
1: Clears the flag
0: No change in the flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>BATT_OVER_UL</name>
              <description>[0:0] Read:
1: Battery level is above the upper limit set by BATTUL.
0: Battery level is not above the upper limit set by BATTUL.
Write:
1: Clears the flag
0: No change in the flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>BATTUL</name>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <description>Battery Upper Limit</description>
          <fields>
            <field>
              <name>RESERVED11</name>
              <description>[31:11] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>21</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>INT</name>
              <description>[10:8] Integer part:

0x0: 0V + fractional part
...
0x3: 3V + fractional part
0x4: 4V + fractional part</description>
              <bitWidth>3</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>FRAC</name>
              <description>[7:0] Fractional part, standard binary fractional encoding.

0x00: .0V
...
0x20: 1/8 = .125V
0x40: 1/4 = .25V
0x80: 1/2 = .5V
...
0xA0: 1/2 + 1/8 = .625V
...
0xFF: Max</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x7FF</resetValue>
        </register>
        <register>
          <name>BATTLL</name>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <description>Battery Lower Limit</description>
          <fields>
            <field>
              <name>RESERVED11</name>
              <description>[31:11] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>21</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>INT</name>
              <description>[10:8] Integer part:

0x0: 0V + fractional part
...
0x3: 3V + fractional part
0x4: 4V + fractional part</description>
              <bitWidth>3</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>FRAC</name>
              <description>[7:0] Fractional part, standard binary fractional encoding.

0x00: .0V
...
0x20: 1/8 = .125V
0x40: 1/4 = .25V
0x80: 1/2 = .5V
...
0xA0: 1/2 + 1/8 = .625V
...
0xFF: Max</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>TEMPUL</name>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <description>Temperature Upper Limit</description>
          <fields>
            <field>
              <name>RESERVED17</name>
              <description>[31:17] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>15</bitWidth>
              <bitOffset>17</bitOffset>
            </field>
            <field>
              <name>INT</name>
              <description>[16:8] Integer part (signed) of temperature upper limit. 
Total value = INTEGER + FRACTIONAL
2's complement encoding

0x100: Min value
0x1D8: -40C
0x1FF: -1C
0x00: 0C
0x1B: 27C
0x55: 85C
0xFF: Max value</description>
              <bitWidth>9</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>FRAC</name>
              <description>[7:6] Fractional part of temperature upper limit.
Total value = INTEGER + FRACTIONAL
The encoding is an extension of the 2's complement encoding.

00: 0.0C
01: 0.25C
10: 0.5C
11: 0.75C

For example:
000000001,00 = ( 1+0,00) =  1,00
000000000,11 = ( 0+0,75) =  0,75
000000000,10 = ( 0+0,50) =  0,50
000000000,01 = ( 0+0,25) =  0,25
000000000,00 = ( 0+0,00) =  0,00
111111111,11 = (-1+0,75) = -0,25
111111111,10 = (-1+0,50) = -0,50
111111111,01 = (-1+0,25) = -0,75
111111111,00 = (-1+0,00) = -1,00
111111110,11 = (-2+0,75) = -1,25</description>
              <bitWidth>2</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>[5:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0xFFC0</resetValue>
        </register>
        <register>
          <name>TEMPLL</name>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <description>Temperature Lower Limit</description>
          <fields>
            <field>
              <name>RESERVED17</name>
              <description>[31:17] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>15</bitWidth>
              <bitOffset>17</bitOffset>
            </field>
            <field>
              <name>INT</name>
              <description>[16:8] Integer part (signed) of temperature lower limit. 
Total value = INTEGER + FRACTIONAL
2's complement encoding

0x100: Min value
0x1D8: -40C
0x1FF: -1C
0x00: 0C
0x1B: 27C
0x55: 85C
0xFF: Max value</description>
              <bitWidth>9</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>FRAC</name>
              <description>[7:6] Fractional part of temperature lower limit.
Total value = INTEGER + FRACTIONAL
The encoding is an extension of the 2's complement encoding.

00: 0.0C
01: 0.25C
10: 0.5C
11: 0.75C

For example:
000000001,00 = ( 1+0,00) =  1,00
000000000,11 = ( 0+0,75) =  0,75
000000000,10 = ( 0+0,50) =  0,50
000000000,01 = ( 0+0,25) =  0,25
000000000,00 = ( 0+0,00) =  0,00
111111111,11 = (-1+0,75) = -0,25
111111111,10 = (-1+0,50) = -0,50
111111111,01 = (-1+0,25) = -0,75
111111111,00 = (-1+0,00) = -1,00
111111110,11 = (-2+0,75) = -1,25</description>
              <bitWidth>2</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>[5:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x10000</resetValue>
        </register>
