seanmlyons22/ti-lprf-pacs/svds/cc13x2_cc26x2.svd
        <register>
          <name>EVSTAT1L</name>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <description>Event Status 1 Low</description>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>ALIAS_EV</name>
              <description>[7:0] Alias of EVSTAT1 event 7 down to 0.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>EVSTAT1H</name>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <description>Event Status 1 High</description>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>ALIAS_EV</name>
              <description>[7:0] Alias of EVSTAT1 event 15 down to 8.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>EVSTAT2L</name>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <description>Event Status 2 Low</description>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>ALIAS_EV</name>
              <description>[7:0] Alias of EVSTAT2 event 7 down to 0.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>EVSTAT2H</name>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <description>Event Status 2 High</description>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>ALIAS_EV</name>
              <description>[7:0] Alias of EVSTAT2 event 15 down to 8.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>EVSTAT3L</name>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <description>Event Status 3 Low</description>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>ALIAS_EV</name>
              <description>[7:0] Alias of EVSTAT3 event 7 down to 0.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>EVSTAT3H</name>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <description>Event Status 3 High</description>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>ALIAS_EV</name>
              <description>[7:0] Alias of EVSTAT3 event 15 down to 8.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>AUX_MAC</name>
      <baseAddress>0x400C2000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <description>The AUX Multiply-Accumulate (AUX_MAC) peripheral enables AUX_SCE with power-efficient and flexible mathematical operations:
- 2's complement signed and unsigned sequential multiplication (MUL) with optional accumulation of the result (MAC).
- 16 or 32-bit 2's complement signed and unsigned addition of configurable term and accumulator (ADD).
- Results of ADD, MUL and MAC operations are always stored in the accumulator (ACC).

Software can easily:
- Access arbitrary 16-bit slice of the 40-bit accumulator.
- Find the number of leading zero or sign bits. 
- Perform shift operations on the accumulator.

AUX_SCE must set AUX_SYSIF:PEROPRATE.MAC_OP_RATE to SCE_RATE to access and use AUX_MAC. System CPU must set AUX_SYSIF:PEROPRATE.MAC_OP_RATE to BUS_RATE to access and use AUX_MAC. This guarantees constant execution times for ADD, MUL, and MAC operations.

The ADD operation requires a single peripheral clock cycle to finish. MUL and MAC operations require four peripheral clock periods to finish. An unfinished ADD, MUL, or MAC operation stalls register access to this peripheral. AUX_SCE becomes clock gated if it encounters a bus stall. Software can use this to reduce power consumption during back to back accesses.

