seanmlyons22/ti-lprf-pacs/svds/cc13x2_cc26x2.svd
0: Disable ADC clock.
1: Enable ADC clock.

Only modify REQ when equal to ACK.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>TDCCLKCTL</name>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <description>TDC Counter Clock Control

Controls if the AUX_TDC counter clock source is enabled. TDC counter clock source is configured in DDI_0_OSC:CTL0.ACLK_TDC_SRC_SEL.</description>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>ACK</name>
              <description>[1:1] TDC counter clock acknowledgement.

0: TDC counter clock is disabled.
1: TDC counter clock is enabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>REQ</name>
              <description>[0:0] TDC counter clock request.

0: Disable TDC counter clock.
1: Enable TDC counter clock.

Only modify REQ when equal to ACK.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>TDCREFCLKCTL</name>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <description>TDC Reference Clock Control

Controls if the AUX_TDC reference clock source is enabled. This clock is compared against the AUX_TDC counter clock. TDC reference clock source is configured in DDI_0_OSC:CTL0.ACLK_REF_SRC_SEL.</description>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>ACK</name>
              <description>[1:1] TDC reference clock acknowledgement.

0: TDC reference clock is disabled.
1: TDC reference clock is enabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>REQ</name>
              <description>[0:0] TDC reference clock request.

0: Disable TDC reference clock.
1: Enable TDC reference clock.

Only modify REQ when equal to ACK.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>TIMER2CLKCTL</name>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <description>AUX_TIMER2 Clock Control

Access to AUX_TIMER2 is only possible when TIMER2CLKSTAT.STAT is different from NONE.</description>
          <fields>
            <field>
              <name>RESERVED3</name>
              <description>[31:3] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>29</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>SRC</name>
              <description>[2:0] Select clock source for AUX_TIMER2.

Update is only accepted if SRC equals TIMER2CLKSTAT.STAT or TIMER2CLKSWITCH.RDY is 1.

It is recommended to select NONE only when TIMER2BRIDGE.BUSY is 0. 

A non-enumerated value is ignored.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SCLK_HFDIV2</name>
                  <value>4</value>
                  <description>SCLK_HF / 2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCLK_MF</name>
                  <value>2</value>
                  <description>SCLK_MF</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCLK_LF</name>
                  <value>1</value>
                  <description>SCLK_LF</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>0</value>
                  <description>no clock</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>TIMER2CLKSTAT</name>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <description>AUX_TIMER2 Clock Status</description>
          <fields>
            <field>
              <name>RESERVED3</name>
              <description>[31:3] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>29</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>STAT</name>
              <description>[2:0] AUX_TIMER2 clock source status.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SCLK_HFDIV2</name>
                  <value>4</value>
                  <description>SCLK_HF / 2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCLK_MF</name>
                  <value>2</value>
                  <description>SCLK_MF</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCLK_LF</name>
                  <value>1</value>
                  <description>SCLK_LF</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>0</value>
                  <description>No clock</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>TIMER2CLKSWITCH</name>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <description>AUX_TIMER2 Clock Switch</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>RDY</name>
              <description>[0:0] Status of clock switcher.

