seanmlyons22/ti-lprf-pacs/svds/cc13x2_cc26x2.svd
0: TIMER2CLKCTL.SRC is different from TIMER2CLKSTAT.STAT.
1: TIMER2CLKCTL.SRC equals TIMER2CLKSTAT.STAT.

RDY connects to AUX_EVCTL:EVSTAT3.AUX_TIMER2_CLKSWITCH_RDY.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>TIMER2DBGCTL</name>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <description>AUX_TIMER2 Debug Control</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>DBG_FREEZE_EN</name>
              <description>[0:0] Debug freeze enable.

0: AUX_TIMER2 does not halt when the system CPU halts in debug mode.
1: Halt AUX_TIMER2 when the system CPU halts in debug mode.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>CLKSHIFTDET</name>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <description>Clock Shift Detection

A transition in the MCU domain state causes a non-accumulative change to the SCE clock period when the AUX clock rate is derived from SCLK_MF or SCLK_LF:
- A single SCE clock cycle is 6 thru 8 SCLK_HF cycles longer when MCU domain enters active state.
- A single SCE clock cycle is 6 thru 8 SCLK_HF cycles shorter when MCU domain exits active state.
 
AUX_SCE detects if such events occurred to the SCE clock during the time period between a clear of STAT and a read of STAT.</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Clock shift detection.

Write:

0: Restart clock shift detection.
1: Do not use.

Read:

0: MCU domain did not enter or exit active state since you wrote 0 to STAT. 
1: MCU domain entered or exited active state since you wrote 0 to STAT.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>RECHARGETRIG</name>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <description>VDDR Recharge Trigger</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>TRIG</name>
              <description>[0:0] Recharge trigger.

0: No effect.
1: Request VDDR recharge. 

Request VDDR recharge only when AUX_EVCTL:EVSTAT2.PWR_DWN is 1. 

Follow this sequence when OPMODEREQ.REQ is LP:
- Set TRIG.
- Wait until AUX_EVCTL:EVSTAT2.VDDR_RECHARGE is 1.
- Clear TRIG.
- Wait until AUX_EVCTL:EVSTAT2.VDDR_RECHARGE is 0.

Follow this sequence when OPMODEREQ.REQ is PDA or PDLP:
- Set TRIG.
- Clear TRIG.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RECHARGEDET</name>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <description>VDDR Recharge Detection

Some applications can be sensitive to power noise caused by recharge of VDDR. You can detect if VDDR recharge occurs.</description>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>STAT</name>
              <description>[1:1] VDDR recharge detector status.

0: No recharge of VDDR has occurred since EN was set.
1: Recharge of VDDR has occurred since EN was set.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>EN</name>
              <description>[0:0] VDDR recharge detector enable.

0: Disable recharge detection. STAT becomes zero.
1: Enable recharge detection.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RTCSUBSECINC0</name>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <description>Real Time Counter Sub Second Increment 0

INC15_0 will replace bits 15:0 in AON_RTC:SUBSECINC when RTCSUBSECINCCTL.UPD_REQ is set.</description>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>INC15_0</name>
              <description>[15:0] New value for bits 15:0 in AON_RTC:SUBSECINC.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RTCSUBSECINC1</name>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <description>Real Time Counter Sub Second Increment 1

INC23_16 will replace bits 23:16 in AON_RTC:SUBSECINC when RTCSUBSECINCCTL.UPD_REQ is set.</description>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>INC23_16</name>
              <description>[7:0] New value for bits 23:16 in AON_RTC:SUBSECINC.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RTCSUBSECINCCTL</name>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <description>Real Time Counter Sub Second Increment Control</description>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>UPD_ACK</name>
              <description>[1:1] Update acknowledgement.

0: AON_RTC has not acknowledged UPD_REQ. 
1: AON_RTC has acknowledged UPD_REQ.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>UPD_REQ</name>
              <description>[0:0] Request AON_RTC to update AON_RTC:SUBSECINC.

0: Clear request to update.
1: Set request to update.

Only change UPD_REQ when it equals UPD_ACK. Clear UPD_REQ after UPD_ACK is 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RTCSEC</name>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <description>Real Time Counter Second 

