seanmlyons22/ti-lprf-pacs/svds/cc13x2_cc26x2.svd
Channel captures counter value at selected edge on signal source selected by CAPT_SRC. See CH2EVCFG.CCACT.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RISING</name>
                  <value>1</value>
                  <description>Capture CNTR.VALUE at rising edge of CAPT_SRC.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALLING</name>
                  <value>0</value>
                  <description>Capture CNTR.VALUE at falling edge of CAPT_SRC.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>CH2PCC</name>
          <addressOffset>0xa8</addressOffset>
          <size>32</size>
          <description>Channel 2 Pipeline Capture Compare</description>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>VALUE</name>
              <description>[15:0] Pipeline Capture Compare value.

16-bit user defined pipeline compare value or channel-updated capture value.

Compare mode: 
An update of VALUE will be transferred to CH2CC.VALUE when the next CNTR.VALUE is zero and CTL.MODE is different from DIS. This is useful for PWM generation and prevents jitter on the edges of the generated signal.

Capture mode: 
When CH2EVCFG.CCACT equals PER_PULSE_WIDTH_MEAS then VALUE contains the width of the low or high phase of the selected signal. This is specified by CH2CCFG.EDGE and CH2CCFG.CAPT_SRC.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>CH2CC</name>
          <addressOffset>0xac</addressOffset>
          <size>32</size>
          <description>Channel 2 Capture Compare</description>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>VALUE</name>
              <description>[15:0] Capture Compare value.

16-bit user defined compare value or channel-updated capture value.

Compare mode: 
VALUE is compared against CNTR.VALUE and an event is generated as specified by CH2EVCFG.CCACT when these are equal. 

Capture mode: 
The current counter value is stored in VALUE when a capture event occurs. CH2EVCFG.CCACT determines if VALUE is a signal period or a regular capture value.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>CH3EVCFG</name>
          <addressOffset>0xb0</addressOffset>
          <size>32</size>
          <description>Channel 3 Event Configuration

This register configures channel function and enables event outputs.

Each channel has an edge-detection circuit with memory. The circuit is:  
 - enabled while CCACT selects a capture function and CTL.MODE is different from DIS. 
 - flushed while CCACT selects a capture function and you change CTL.MODE from DIS to another mode. 
 
The flush action uses two AUX_SYSIF:TIMER2CLKCTL.SRC clock periods. It prevents capture events caused by expired signal values stored in the edge-detection circuit.</description>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>EV3_GEN</name>
              <description>[7:7] Event 3 enable.

0: Channel 3 does not control event 3.
1: Channel 3 controls event 3.

 When 0 &lt; CCACT &lt; 8, EV3_GEN becomes zero after a capture or compare event.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>EV2_GEN</name>
              <description>[6:6] Event 2 enable.

0: Channel 3 does not control event 2.
1: Channel 3 controls event 2.

 When 0 &lt; CCACT &lt; 8, EV2_GEN becomes zero after a capture or compare event.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>EV1_GEN</name>
              <description>[5:5] Event 1 enable.

0: Channel 3 does not control event 1.
1: Channel 3 controls event 1.

 When 0 &lt; CCACT &lt; 8, EV1_GEN becomes zero after a capture or compare event.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>EV0_GEN</name>
              <description>[4:4] Event 0 enable.

0: Channel 3 does not control event 0.
1: Channel 3 controls event 0.

 When 0 &lt; CCACT &lt; 8, EV0_GEN becomes zero after a capture or compare event.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>CCACT</name>
              <description>[3:0] Capture-Compare action.

Capture-Compare action defines 15 different channel functions that utilize capture, compare, and zero events.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PULSE_ON_CMP</name>
                  <value>15</value>
                  <description>Pulse on compare repeatedly. 

