seanmlyons22/ti-lprf-pacs/svds/cc13x2_cc26x2.svd
16-bit user defined pipeline compare value or channel-updated capture value.

Compare mode: 
An update of VALUE will be transferred to CH3CC.VALUE when the next CNTR.VALUE is zero and CTL.MODE is different from DIS. This is useful for PWM generation and prevents jitter on the edges of the generated signal.

Capture mode: 
When CH3EVCFG.CCACT equals PER_PULSE_WIDTH_MEAS then VALUE contains the width of the low or high phase of the selected signal. This is specified by CH3CCFG.EDGE and CH3CCFG.CAPT_SRC.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>CH3CC</name>
          <addressOffset>0xbc</addressOffset>
          <size>32</size>
          <description>Channel 3 Capture Compare</description>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>VALUE</name>
              <description>[15:0] Capture Compare value.

16-bit user defined compare value or channel-updated capture value.

Compare mode: 
VALUE is compared against CNTR.VALUE and an event is generated as specified by CH3EVCFG.CCACT when these are equal. 

Capture mode: 
The current counter value is stored in VALUE when a capture event occurs. CH3EVCFG.CCACT determines if VALUE is a signal period or a regular capture value.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>CCFG</name>
      <baseAddress>0x50003000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x2000</size>
        <usage>registers</usage>
      </addressBlock>
      <description>Customer configuration area (CCFG)</description>
      <registers>
        <register>
          <name>RESERVED_0</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
          <fields>
            <field>
              <name>RESERVED0</name>
              <description>[31:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0xFFFFFFFF</resetValue>
        </register>
        <register>
          <name>EXT_LF_CLK</name>
          <addressOffset>0x1fa8</addressOffset>
          <size>32</size>
          <description>Extern LF clock configuration</description>
          <fields>
            <field>
              <name>DIO</name>
              <description>[31:24] Unsigned integer, selecting the DIO to supply external 32 kHz clock as SCLK_LF when MODE_CONF.SCLK_LF_OPTION is set to EXTERNAL. The selected DIO will be marked as reserved by the pin driver (TI-RTOS environment) and hence not selectable for other usage.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>RTC_INCREMENT</name>
              <description>[23:0] Unsigned integer, defining the input frequency of the external clock and is written to AON_RTC:SUBSECINC.VALUEINC. Defined as follows: EXT_LF_CLK.RTC_INCREMENT = 2^38/InputClockFrequency in Hertz (e.g.: RTC_INCREMENT=0x800000 for InputClockFrequency=32768 Hz)</description>
              <bitWidth>24</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0xFFFFFFFF</resetValue>
        </register>
        <register>
          <name>MODE_CONF_1</name>
          <addressOffset>0x1fac</addressOffset>
          <size>32</size>
          <description>Mode Configuration 1</description>
          <fields>
            <field>
              <name>TCXO_TYPE</name>
              <description>[31:31] Selects the TCXO type.

0: CMOS type. Internal common-mode bias will not be enabled.
1: Clipped-sine type. Internal common-mode bias will be enabled when TCXO is used.

Bit field value is only valid if MODE_CONF.XOSC_FREQ=0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>31</bitOffset>
            </field>
            <field>
              <name>TCXO_MAX_START</name>
              <description>[30:24] Maximum TCXO startup time in units of 100us.
Bit field value is only valid if MODE_CONF.XOSC_FREQ=0.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>ALT_DCDC_VMIN</name>
              <description>[23:20] Minimum voltage for when DC/DC should be used if alternate DC/DC setting is enabled (SIZE_AND_DIS_FLAGS.DIS_ALT_DCDC_SETTING=0).
Voltage = (28 + ALT_DCDC_VMIN) / 16.
0: 1.75V
1: 1.8125V
...
14: 2.625V
15: 2.6875V

NOTE! The DriverLib function SysCtrl_DCDC_VoltageConditionalControl() must be called regularly to apply this field (handled automatically if using TI RTOS!).</description>
              <bitWidth>4</bitWidth>
              <bitOffset>20</bitOffset>
            </field>
            <field>
              <name>ALT_DCDC_DITHER_EN</name>
              <description>[19:19] Enable DC/DC dithering if alternate DC/DC setting is enabled (SIZE_AND_DIS_FLAGS.DIS_ALT_DCDC_SETTING=0).
0: Dither disable
1: Dither enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>19</bitOffset>
            </field>
            <field>
              <name>ALT_DCDC_IPEAK</name>
              <description>[18:16] Inductor peak current if alternate DC/DC setting is enabled (SIZE_AND_DIS_FLAGS.DIS_ALT_DCDC_SETTING=0). Assuming 10uH external inductor!

0: 46mA (min)
...
4: 70mA
...
7: 87mA (max)</description>
              <bitWidth>3</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>DELTA_IBIAS_INIT</name>
              <description>[15:12] Signed delta value for IBIAS_INIT. Delta value only applies if SIZE_AND_DIS_FLAGS.DIS_XOSC_OVR=0.
See FCFG1:AMPCOMP_CTRL1.IBIAS_INIT</description>
              <bitWidth>4</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>DELTA_IBIAS_OFFSET</name>
              <description>[11:8] Signed delta value for IBIAS_OFFSET. Delta value only applies if SIZE_AND_DIS_FLAGS.DIS_XOSC_OVR=0.
See FCFG1:AMPCOMP_CTRL1.IBIAS_OFFSET</description>
              <bitWidth>4</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>XOSC_MAX_START</name>
              <description>[7:0] Unsigned value of maximum XOSC startup time (worst case) in units of 100us. Value only applies if SIZE_AND_DIS_FLAGS.DIS_XOSC_OVR=0.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0xFFFFFFFF</resetValue>
        </register>
        <register>
          <name>SIZE_AND_DIS_FLAGS</name>
          <addressOffset>0x1fb0</addressOffset>
          <size>32</size>
          <description>CCFG Size and Disable Flags</description>
          <fields>
            <field>
              <name>SIZE_OF_CCFG</name>
              <description>[31:16] Total size of CCFG in bytes.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>DISABLE_FLAGS</name>
              <description>[15:5] Reserved for future use. Software should not rely on the value of a reserved. Writing any other value than the reset/default value may result in undefined behavior.</description>
              <bitWidth>11</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>DIS_LINEAR_CAPARRAY_DELTA_WORKAROUND</name>
              <description>[4:4] The default CAPARRAY setting is good as long as no CAPARRAY_DELTA adjustment is added but the CAPARRAY setting will give an un-linear behavior if the workaround is not enabled. The workaround is disabled by default to avoid unexpected changes upon software updates.

