seanmlyons22/ti-lprf-pacs/svds/cc13x2_cc26x2.svd
0: The CAPARRAY_DELTA workaround is enabled.
1: The CAPARRAY_DELTA workaround is disabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>DIS_TCXO</name>
              <description>[3:3] Deprecated. Must be set to 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>DIS_GPRAM</name>
              <description>[2:2] Disable GPRAM (or use the 8K VIMS RAM as CACHE RAM).
0: GPRAM is enabled and hence CACHE disabled.
1: GPRAM is disabled and instead CACHE is enabled (default).
Notes:
- Disabling CACHE will reduce CPU execution speed (up to 60%).
- GPRAM is 8 K-bytes in size and located at 0x11000000-0x11001FFF if enabled.
See:
VIMS:CTL.MODE</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>DIS_ALT_DCDC_SETTING</name>
              <description>[1:1] Disable alternate DC/DC settings. 
0: Enable alternate DC/DC settings.
1: Disable alternate DC/DC settings.
See:
MODE_CONF_1.ALT_DCDC_VMIN
MODE_CONF_1.ALT_DCDC_DITHER_EN
MODE_CONF_1.ALT_DCDC_IPEAK

NOTE! The DriverLib function SysCtrl_DCDC_VoltageConditionalControl() must be called regularly to apply this field (handled automatically if using TI RTOS!).</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>DIS_XOSC_OVR</name>
              <description>[0:0] Disable XOSC override functionality.
0: Enable XOSC override functionality.
1: Disable XOSC override functionality.
See:
MODE_CONF_1.DELTA_IBIAS_INIT
MODE_CONF_1.DELTA_IBIAS_OFFSET
MODE_CONF_1.XOSC_MAX_START</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0xFFFFFFFF</resetValue>
        </register>
        <register>
          <name>MODE_CONF</name>
          <addressOffset>0x1fb4</addressOffset>
          <size>32</size>
          <description>Mode Configuration 0</description>
          <fields>
            <field>
              <name>VDDR_TRIM_SLEEP_DELTA</name>
              <description>[31:28] Signed delta value to apply to the
VDDR_TRIM_SLEEP target, minus one. See FCFG1:VOLT_TRIM.VDDR_TRIM_SLEEP_H.
0x8 (-8) : Delta = -7
...
0xF (-1) : Delta = 0
0x0 (0) : Delta = +1
...
0x7 (7) : Delta = +8</description>
              <bitWidth>4</bitWidth>
              <bitOffset>28</bitOffset>
            </field>
            <field>
              <name>DCDC_RECHARGE</name>
              <description>[27:27] DC/DC during recharge in powerdown.
0: Use the DC/DC during recharge in powerdown.
1: Do not use the DC/DC during recharge in powerdown (default).

NOTE! The DriverLib function SysCtrl_DCDC_VoltageConditionalControl() must be called regularly to apply this field (handled automatically if using TI RTOS!).</description>
              <bitWidth>1</bitWidth>
              <bitOffset>27</bitOffset>
            </field>
            <field>
              <name>DCDC_ACTIVE</name>
              <description>[26:26] DC/DC in active mode.
0: Use the DC/DC during active mode.
1: Do not use the DC/DC during active mode (default).

NOTE! The DriverLib function SysCtrl_DCDC_VoltageConditionalControl() must be called regularly to apply this field (handled automatically if using TI RTOS!).</description>
              <bitWidth>1</bitWidth>
              <bitOffset>26</bitOffset>
            </field>
            <field>
              <name>VDDR_EXT_LOAD</name>
              <description>[25:25] Reserved for future use. Software should not rely on the value of a reserved. Writing any other value than the reset/default value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>25</bitOffset>
            </field>
            <field>
              <name>VDDS_BOD_LEVEL</name>
              <description>[24:24] VDDS BOD level.
0: VDDS BOD level is 2.0V (necessary for external load mode, or for maximum PA output power on CC13xx).
1: VDDS BOD level is 1.8V (or 1.65V for external regulator mode) (default).</description>
              <bitWidth>1</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>SCLK_LF_OPTION</name>
              <description>[23:22] Select source for SCLK_LF.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>22</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RCOSC_LF</name>
                  <value>3</value>
                  <description>Low frequency RCOSC (default)</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XOSC_LF</name>
                  <value>2</value>
                  <description>32.768 kHz low frequency XOSC</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTERNAL_LF</name>
                  <value>1</value>
                  <description>External low frequency clock on DIO defined by EXT_LF_CLK.DIO. The RTC tick speed AON_RTC:SUBSECINC is updated to EXT_LF_CLK.RTC_INCREMENT (done in the SetupTrimDevice() driverlib boot function). External clock must always be running when the chip is in standby for VDDR recharge timing.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XOSC_HF_DLF</name>
                  <value>0</value>
                  <description>31.25 kHz clock derived from 48 MHz XOSC or HPOSC. The RTC tick speed AON_RTC:SUBSECINC is updated to 0x8637BD, corresponding to a 31.25 kHz clock (done in the SetupTrimDevice() driverlib boot function). The device must be blocked from entering Standby mode when using this clock source.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VDDR_TRIM_SLEEP_TC</name>
              <description>[21:21] 0x1: VDDR_TRIM_SLEEP_DELTA is not temperature compensated
0x0: RTOS/driver temperature compensates VDDR_TRIM_SLEEP_DELTA every time standby mode is entered. This improves low-temperature RCOSC_LF frequency stability in standby mode.

When temperature compensation is performed, the delta is calculates this way:
Delta = max (delta, min(8, floor(62-temp)/8))
Here, delta is given by VDDR_TRIM_SLEEP_DELTA, and temp is the current temperature in degrees C.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>21</bitOffset>
            </field>
            <field>
              <name>RTC_COMP</name>
              <description>[20:20] Reserved for future use. Software should not rely on the value of a reserved. Writing any other value than the reset/default value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>20</bitOffset>
            </field>
            <field>
              <name>XOSC_FREQ</name>
              <description>[19:18] Selects which high frequency oscillator is used (required for radio usage).</description>
              <bitWidth>2</bitWidth>
              <bitOffset>18</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>24M</name>
                  <value>3</value>
                  <description>24 MHz XOSC_HF. Not supported.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>48M</name>
                  <value>2</value>
                  <description>48 MHz XOSC_HF</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPOSC</name>
                  <value>1</value>
                  <description>Internal high precision oscillator.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCXO</name>
                  <value>0</value>
                  <description>External 48 MHz TCXO.
Refer to MODE_CONF_1.TCXO_MAX_START and MODE_CONF_1.TCXO_TYPE bit fields for additional configuration of TCXO.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XOSC_CAP_MOD</name>
              <description>[17:17] Enable modification (delta) to XOSC cap-array. Value specified in XOSC_CAPARRAY_DELTA.
0: Apply cap-array delta
1: Do not apply cap-array delta (default)</description>
              <bitWidth>1</bitWidth>
              <bitOffset>17</bitOffset>
            </field>
            <field>
              <name>HF_COMP</name>
              <description>[16:16] Reserved for future use. Software should not rely on the value of a reserved. Writing any other value than the reset/default value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>XOSC_CAPARRAY_DELTA</name>
              <description>[15:8] Signed 8-bit value, directly modifying trimmed XOSC cap-array step value. Enabled by XOSC_CAP_MOD.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>VDDR_CAP</name>
              <description>[7:0] Unsigned 8-bit integer, representing the minimum decoupling capacitance (worst case) on VDDR, in units of 100nF. This should take into account capacitor tolerance and voltage dependent capacitance variation. This bit affects the recharge period calculation when going into powerdown or standby.
 
