seanmlyons22/ti-lprf-pacs/svds/cc13x2_cc26x2.svd
        <register>
          <name>NVIC_IPR5</name>
          <addressOffset>0x414</addressOffset>
          <size>32</size>
          <description>Irq 20 to 23 Priority
This register is used to assign a priority from 0 to 255 to each of the available interrupts. 0 is the highest priority, and 255 is the lowest. The interpretation of the Interrupt Priority Registers changes based on the setting in AIRCR.PRIGROUP.</description>
          <fields>
            <field>
              <name>PRI_23</name>
              <description>[31:24] Priority of interrupt 23 (See EVENT:CPUIRQSEL23.EV for details).</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>PRI_22</name>
              <description>[23:16] Priority of interrupt 22 (See EVENT:CPUIRQSEL22.EV for details).</description>
              <bitWidth>8</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>PRI_21</name>
              <description>[15:8] Priority of interrupt 21 (See EVENT:CPUIRQSEL21.EV for details).</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>PRI_20</name>
              <description>[7:0] Priority of interrupt 20 (See EVENT:CPUIRQSEL20.EV for details).</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>NVIC_IPR6</name>
          <addressOffset>0x418</addressOffset>
          <size>32</size>
          <description>Irq 24 to 27 Priority
This register is used to assign a priority from 0 to 255 to each of the available interrupts. 0 is the highest priority, and 255 is the lowest. The interpretation of the Interrupt Priority Registers changes based on the setting in AIRCR.PRIGROUP.</description>
          <fields>
            <field>
              <name>PRI_27</name>
              <description>[31:24] Priority of interrupt 27 (See EVENT:CPUIRQSEL27.EV for details).</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>PRI_26</name>
              <description>[23:16] Priority of interrupt 26 (See EVENT:CPUIRQSEL26.EV for details).</description>
              <bitWidth>8</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>PRI_25</name>
              <description>[15:8] Priority of interrupt 25 (See EVENT:CPUIRQSEL25.EV for details).</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>PRI_24</name>
              <description>[7:0] Priority of interrupt 24 (See EVENT:CPUIRQSEL24.EV for details).</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>NVIC_IPR7</name>
          <addressOffset>0x41c</addressOffset>
          <size>32</size>
          <description>Irq 28 to 31 Priority
This register is used to assign a priority from 0 to 255 to each of the available interrupts. 0 is the highest priority, and 255 is the lowest. The interpretation of the Interrupt Priority Registers changes based on the setting in AIRCR.PRIGROUP.</description>
          <fields>
            <field>
              <name>PRI_31</name>
              <description>[31:24] Priority of interrupt 31 (See EVENT:CPUIRQSEL31.EV for details).</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>PRI_30</name>
              <description>[23:16] Priority of interrupt 30 (See EVENT:CPUIRQSEL30.EV for details).</description>
              <bitWidth>8</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>PRI_29</name>
              <description>[15:8] Priority of interrupt 29 (See EVENT:CPUIRQSEL29.EV for details).</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>PRI_28</name>
              <description>[7:0] Priority of interrupt 28 (See EVENT:CPUIRQSEL28.EV for details).</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>NVIC_IPR8</name>
          <addressOffset>0x420</addressOffset>
          <size>32</size>
          <description>Irq 32 to 35 Priority
This register is used to assign a priority from 0 to 255 to each of the available interrupts. 0 is the highest priority, and 255 is the lowest. The interpretation of the Interrupt Priority Registers changes based on the setting in AIRCR.PRIGROUP.</description>
          <fields>
            <field>
              <name>PRI_35</name>
              <description>[31:24] Priority of interrupt 35 (See EVENT:CPUIRQSEL35.EV for details).</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>PRI_34</name>
              <description>[23:16] Priority of interrupt 34 (See EVENT:CPUIRQSEL34.EV for details).</description>
              <bitWidth>8</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>PRI_33</name>
              <description>[15:8] Priority of interrupt 33 (See EVENT:CPUIRQSEL33.EV for details).</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>PRI_32</name>
              <description>[7:0] Priority of interrupt 32 (See EVENT:CPUIRQSEL32.EV for details).</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>NVIC_IPR9</name>
          <addressOffset>0x424</addressOffset>
          <size>32</size>
          <description>Irq 32 to 35 Priority
This register is used to assign a priority from 0 to 255 to each of the available interrupts. 0 is the highest priority, and 255 is the lowest. The interpretation of the Interrupt Priority Registers changes based on the setting in AIRCR.PRIGROUP.</description>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>PRI_37</name>
              <description>[15:8] Priority of interrupt 37 (See EVENT:CPUIRQSEL37.EV for details).</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>PRI_36</name>
              <description>[7:0] Priority of interrupt 36 (See EVENT:CPUIRQSEL36.EV for details).</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>CPUID</name>
          <addressOffset>0xd00</addressOffset>
          <size>32</size>
          <description>CPUID Base
This register determines the ID number of the processor core, the version number of the processor core and the implementation details of the processor core.</description>
          <fields>
            <field>
              <name>IMPLEMENTER</name>
              <description>[31:24] Implementor code.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>VARIANT</name>
              <description>[23:20] Implementation defined variant number.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>20</bitOffset>
            </field>
            <field>
              <name>CONSTANT</name>
              <description>[19:16] Reads as 0xF</description>
              <bitWidth>4</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>PARTNO</name>
              <description>[15:4] Number of processor within family.</description>
              <bitWidth>12</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>REVISION</name>
              <description>[3:0] Implementation defined revision number.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x410FC241</resetValue>
        </register>
        <register>
          <name>ICSR</name>
          <addressOffset>0xd04</addressOffset>
          <size>32</size>
          <description>Interrupt Control State
This register is used to set a pending Non-Maskable Interrupt (NMI), set or clear a pending SVC, set or clear a pending SysTick, check for pending exceptions, check the vector number of the highest priority pended exception, and check the vector number of the active exception.</description>
          <fields>
            <field>
              <name>NMIPENDSET</name>
              <description>[31:31] Set pending NMI bit. Setting this bit pends and activates an NMI. Because NMI is the highest-priority interrupt, it takes effect as soon as it registers.

