seanmlyons22/ti-lprf-pacs/svds/cc13x2_cc26x2.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>AUX_DDI0_OSC</name>
      <baseAddress>0x400CA000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <description>This is the DDI for the digital block that controls all the analog clock oscillators  (OSC_DIG) and performs qualification of the clocks generated.</description>
      <registers>
        <register>
          <name>CTL0</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>Control 0
Controls clock source selects</description>
          <fields>
            <field>
              <name>XTAL_IS_24M</name>
              <description>[31:31] Set based on the accurate high frequency XTAL.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>31</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>24M</name>
                  <value>1</value>
                  <description>Internal. Only to be used through TI provided API.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>48M</name>
                  <value>0</value>
                  <description>Internal. Only to be used through TI provided API.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED30</name>
              <description>[30:30] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>30</bitOffset>
            </field>
            <field>
              <name>BYPASS_XOSC_LF_CLK_QUAL</name>
              <description>[29:29] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>29</bitOffset>
            </field>
            <field>
              <name>BYPASS_RCOSC_LF_CLK_QUAL</name>
              <description>[28:28] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>28</bitOffset>
            </field>
            <field>
              <name>DOUBLER_START_DURATION</name>
              <description>[27:26] Internal. Only to be used through TI provided API.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>26</bitOffset>
            </field>
            <field>
              <name>DOUBLER_RESET_DURATION</name>
              <description>[25:25] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>25</bitOffset>
            </field>
            <field>
              <name>CLK_DCDC_SRC_SEL</name>
              <description>[24:24] Select DCDC clock source.

0: CLK_DCDC is 48 MHz clock from RCOSC or XOSC / HPOSC
1: CLK_DCDC is always 48 MHz clock from RCOSC</description>
              <bitWidth>1</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>RESERVED15</name>
              <description>[23:15] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>9</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
            <field>
              <name>HPOSC_MODE_EN</name>
              <description>[14:14] 0: HPOSC mode is not enabled. The 48 MHz crystal is required for radio operation.
1: Enables HPOSC mode. The internal HPOSC can be used as HF system clock and for radio operation.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>RESERVED13</name>
              <description>[13:13] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>RCOSC_LF_TRIMMED</name>
              <description>[12:12] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>XOSC_HF_POWER_MODE</name>
              <description>[11:11] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>XOSC_LF_DIG_BYPASS</name>
              <description>[10:10] Bypass XOSC_LF and use the digital input clock from AON for the xosc_lf clock.

0: Use 32kHz XOSC as xosc_lf clock source
1: Use digital input (from AON) as xosc_lf clock source.

This bit will only have effect when SCLK_LF_SRC_SEL is selecting the xosc_lf as the sclk_lf source. The muxing performed by this bit is not glitch free. The following procedure must be followed when changing this field to avoid glitches on sclk_lf.

1) Set SCLK_LF_SRC_SEL to select any source other than the xosc_lf clock source.
2) Set or clear this bit to bypass or not bypass the xosc_lf.
3) Set SCLK_LF_SRC_SEL to use xosc_lf.

It is recommended that either the rcosc_hf or xosc_hf (whichever is currently active) be selected as the source in step 1 above. This provides a faster clock change.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>CLK_LOSS_EN</name>
              <description>[9:9] Enable clock loss detection and hence the indicators to the system controller.  Checks both SCLK_HF, SCLK_MF and SCLK_LF clock loss indicators.

0: Disable
1: Enable

Clock loss detection must be disabled when changing the sclk_lf source. STAT0.SCLK_LF_SRC can be polled to determine when a change to a new sclk_lf source has completed.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>ACLK_TDC_SRC_SEL</name>
              <description>[8:7] Source select for aclk_tdc.

00: RCOSC_HF (48MHz)
01: RCOSC_HF (24MHz)
10: XOSC_HF (24MHz)
11: Not used</description>
              <bitWidth>2</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>ACLK_REF_SRC_SEL</name>
              <description>[6:4] Source select for aclk_ref

000: RCOSC_HF derived (31.25kHz)
001: XOSC_HF derived (31.25kHz)
010: RCOSC_LF (32kHz)
011: XOSC_LF (32.768kHz)
100: RCOSC_MF (2MHz)
101-111: Not used</description>
              <bitWidth>3</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>SCLK_LF_SRC_SEL</name>
              <description>[3:2] Source select for sclk_lf</description>
              <bitWidth>2</bitWidth>
              <bitOffset>2</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XOSCLF</name>
                  <value>3</value>
                  <description>Low frequency XOSC</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RCOSCLF</name>
                  <value>2</value>
                  <description>Low frequency RCOSC</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XOSCHFDLF</name>
                  <value>1</value>
                  <description>Low frequency clock derived from High Frequency XOSC or HPOSC clk (use HPOSC when HPOSC_MODE_EN = 1)</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RCOSCHFDLF</name>
                  <value>0</value>
                  <description>Low frequency clock derived from High Frequency RCOSC</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED1</name>
              <description>[1:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>SCLK_HF_SRC_SEL</name>
              <description>[0:0] Source select for sclk_hf.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XOSC</name>
                  <value>1</value>
                  <description>High frequency XOSC or HPOSC clk (use HPOSC when HPOSC_MODE_EN = 1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RCOSC</name>
                  <value>0</value>
                  <description>High frequency RCOSC clock</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>CTL1</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>Control 1
This register contains OSC_DIG configuration</description>
          <fields>
            <field>
              <name>RESERVED23</name>
              <description>[31:23] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>9</bitWidth>
              <bitOffset>23</bitOffset>
            </field>
            <field>
              <name>RCOSCHFCTRIMFRACT</name>
              <description>[22:18] Internal. Only to be used through TI provided API.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>18</bitOffset>
            </field>
            <field>
              <name>RCOSCHFCTRIMFRACT_EN</name>
              <description>[17:17] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>17</bitOffset>
            </field>
            <field>
              <name>SPARE2</name>
              <description>[16:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>15</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>XOSC_HF_FAST_START</name>
              <description>[1:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RADCEXTCFG</name>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <description>RADC External Configuration</description>
          <fields>
            <field>
              <name>HPM_IBIAS_WAIT_CNT</name>
              <description>[31:22] Internal. Only to be used through TI provided API.</description>
              <bitWidth>10</bitWidth>
              <bitOffset>22</bitOffset>
            </field>
            <field>
              <name>LPM_IBIAS_WAIT_CNT</name>
              <description>[21:16] Internal. Only to be used through TI provided API.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>IDAC_STEP</name>
              <description>[15:12] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>RADC_DAC_TH</name>
              <description>[11:6] Internal. Only to be used through TI provided API.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>RADC_MODE_IS_SAR</name>
              <description>[5:5] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>[4:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>AMPCOMPCTL</name>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <description>Amplitude Compensation Control</description>
          <fields>
            <field>
              <name>SPARE31</name>
              <description>[31:31] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>31</bitOffset>
            </field>
            <field>
              <name>AMPCOMP_REQ_MODE</name>
              <description>[30:30] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>30</bitOffset>
            </field>
            <field>
              <name>AMPCOMP_FSM_UPDATE_RATE</name>
              <description>[29:28] Internal. Only to be used through TI provided API.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>28</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>250KHZ</name>
                  <value>3</value>
                  <description>Internal. Only to be used through TI provided API.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>500KHZ</name>
                  <value>2</value>
                  <description>Internal. Only to be used through TI provided API.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1MHZ</name>
                  <value>1</value>
                  <description>Internal. Only to be used through TI provided API.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2MHZ</name>
                  <value>0</value>
                  <description>Internal. Only to be used through TI provided API.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AMPCOMP_SW_CTRL</name>
              <description>[27:27] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>27</bitOffset>
            </field>
            <field>
              <name>AMPCOMP_SW_EN</name>
              <description>[26:26] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>26</bitOffset>
            </field>
            <field>
              <name>RESERVED24</name>
              <description>[25:24] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>IBIAS_OFFSET</name>
              <description>[23:20] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>20</bitOffset>
            </field>
            <field>
              <name>IBIAS_INIT</name>
              <description>[19:16] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>LPM_IBIAS_WAIT_CNT_FINAL</name>
              <description>[15:8] Internal. Only to be used through TI provided API.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>CAP_STEP</name>
              <description>[7:4] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>IBIASCAP_HPTOLP_OL_CNT</name>
              <description>[3:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>AMPCOMPTH1</name>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <description>Amplitude Compensation Threshold 1
This register contains threshold values for amplitude compensation algorithm</description>
          <fields>
            <field>
              <name>SPARE24</name>
              <description>[31:24] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>HPMRAMP3_LTH</name>
              <description>[23:18] Internal. Only to be used through TI provided API.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>18</bitOffset>
            </field>
            <field>
              <name>SPARE16</name>
              <description>[17:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>HPMRAMP3_HTH</name>
              <description>[15:10] Internal. Only to be used through TI provided API.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>IBIASCAP_LPTOHP_OL_CNT</name>
              <description>[9:6] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>HPMRAMP1_TH</name>
              <description>[5:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>AMPCOMPTH2</name>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <description>Amplitude Compensation Threshold 2
This register contains threshold values for amplitude compensation algorithm.</description>
          <fields>
            <field>
              <name>LPMUPDATE_LTH</name>
              <description>[31:26] Internal. Only to be used through TI provided API.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>26</bitOffset>
            </field>
            <field>
              <name>SPARE24</name>
              <description>[25:24] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>LPMUPDATE_HTH</name>
              <description>[23:18] Internal. Only to be used through TI provided API.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>18</bitOffset>
            </field>
            <field>
              <name>SPARE16</name>
              <description>[17:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>ADC_COMP_AMPTH_LPM</name>
              <description>[15:10] Internal. Only to be used through TI provided API.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>SPARE8</name>
              <description>[9:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>ADC_COMP_AMPTH_HPM</name>
              <description>[7:2] Internal. Only to be used through TI provided API.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>SPARE0</name>
              <description>[1:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ANABYPASSVAL1</name>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <description>Analog Bypass Values 1</description>
          <fields>
            <field>
              <name>RESERVED20</name>
              <description>[31:20] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>12</bitWidth>
              <bitOffset>20</bitOffset>
            </field>
            <field>
              <name>XOSC_HF_ROW_Q12</name>
              <description>[19:16] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>XOSC_HF_COLUMN_Q12</name>
              <description>[15:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
