seanmlyons22/ti-lprf-pacs/svds/cc13x2_cc26x2.svd
Writing 1 to a bit position clears the corresponding bit in the DOUT31_0 register</description>
          <fields>
            <field>
              <name>DIO31</name>
              <description>[31:31] Clears bit 31</description>
              <bitWidth>1</bitWidth>
              <bitOffset>31</bitOffset>
            </field>
            <field>
              <name>DIO30</name>
              <description>[30:30] Clears bit 30</description>
              <bitWidth>1</bitWidth>
              <bitOffset>30</bitOffset>
            </field>
            <field>
              <name>DIO29</name>
              <description>[29:29] Clears bit 29</description>
              <bitWidth>1</bitWidth>
              <bitOffset>29</bitOffset>
            </field>
            <field>
              <name>DIO28</name>
              <description>[28:28] Clears bit 28</description>
              <bitWidth>1</bitWidth>
              <bitOffset>28</bitOffset>
            </field>
            <field>
              <name>DIO27</name>
              <description>[27:27] Clears bit 27</description>
              <bitWidth>1</bitWidth>
              <bitOffset>27</bitOffset>
            </field>
            <field>
              <name>DIO26</name>
              <description>[26:26] Clears bit 26</description>
              <bitWidth>1</bitWidth>
              <bitOffset>26</bitOffset>
            </field>
            <field>
              <name>DIO25</name>
              <description>[25:25] Clears bit 25</description>
              <bitWidth>1</bitWidth>
              <bitOffset>25</bitOffset>
            </field>
            <field>
              <name>DIO24</name>
              <description>[24:24] Clears bit 24</description>
              <bitWidth>1</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>DIO23</name>
              <description>[23:23] Clears bit 23</description>
              <bitWidth>1</bitWidth>
              <bitOffset>23</bitOffset>
            </field>
            <field>
              <name>DIO22</name>
              <description>[22:22] Clears bit 22</description>
              <bitWidth>1</bitWidth>
              <bitOffset>22</bitOffset>
            </field>
            <field>
              <name>DIO21</name>
              <description>[21:21] Clears bit 21</description>
              <bitWidth>1</bitWidth>
              <bitOffset>21</bitOffset>
            </field>
            <field>
              <name>DIO20</name>
              <description>[20:20] Clears bit 20</description>
              <bitWidth>1</bitWidth>
              <bitOffset>20</bitOffset>
            </field>
            <field>
              <name>DIO19</name>
              <description>[19:19] Clears bit 19</description>
              <bitWidth>1</bitWidth>
              <bitOffset>19</bitOffset>
            </field>
            <field>
              <name>DIO18</name>
              <description>[18:18] Clears bit 18</description>
              <bitWidth>1</bitWidth>
              <bitOffset>18</bitOffset>
            </field>
            <field>
              <name>DIO17</name>
              <description>[17:17] Clears bit 17</description>
              <bitWidth>1</bitWidth>
              <bitOffset>17</bitOffset>
            </field>
            <field>
              <name>DIO16</name>
              <description>[16:16] Clears bit 16</description>
              <bitWidth>1</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>DIO15</name>
              <description>[15:15] Clears bit 15</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
            <field>
              <name>DIO14</name>
              <description>[14:14] Clears bit 14</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>DIO13</name>
              <description>[13:13] Clears bit 13</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>DIO12</name>
              <description>[12:12] Clears bit 12</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>DIO11</name>
              <description>[11:11] Clears bit 11</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>DIO10</name>
              <description>[10:10] Clears bit 10</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>DIO9</name>
              <description>[9:9] Clears bit 9</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>DIO8</name>
              <description>[8:8] Clears bit 8</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>DIO7</name>
              <description>[7:7] Clears bit 7</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>DIO6</name>
              <description>[6:6] Clears bit 6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>DIO5</name>
              <description>[5:5] Clears bit 5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>DIO4</name>
              <description>[4:4] Clears bit 4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>DIO3</name>
              <description>[3:3] Clears bit 3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>DIO2</name>
              <description>[2:2] Clears bit 2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>DIO1</name>
              <description>[1:1] Clears bit 1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>DIO0</name>
              <description>[0:0] Clears bit 0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>DOUTTGL31_0</name>
          <addressOffset>0xb0</addressOffset>
          <size>32</size>
          <description>Data Out Toggle

Writing 1 to a bit position will invert the corresponding DIO output.</description>
          <fields>
            <field>
              <name>DIO31</name>
              <description>[31:31] Toggles bit 31</description>
              <bitWidth>1</bitWidth>
              <bitOffset>31</bitOffset>
            </field>
            <field>
              <name>DIO30</name>
              <description>[30:30] Toggles bit 30</description>
              <bitWidth>1</bitWidth>
              <bitOffset>30</bitOffset>
            </field>
            <field>
              <name>DIO29</name>
              <description>[29:29] Toggles bit 29</description>
              <bitWidth>1</bitWidth>
              <bitOffset>29</bitOffset>
            </field>
            <field>
              <name>DIO28</name>
              <description>[28:28] Toggles bit 28</description>
              <bitWidth>1</bitWidth>
              <bitOffset>28</bitOffset>
            </field>
            <field>
              <name>DIO27</name>
              <description>[27:27] Toggles bit 27</description>
              <bitWidth>1</bitWidth>
              <bitOffset>27</bitOffset>
            </field>
            <field>
              <name>DIO26</name>
              <description>[26:26] Toggles bit 26</description>
              <bitWidth>1</bitWidth>
              <bitOffset>26</bitOffset>
            </field>
            <field>
              <name>DIO25</name>
              <description>[25:25] Toggles bit 25</description>
              <bitWidth>1</bitWidth>
              <bitOffset>25</bitOffset>
            </field>
            <field>
              <name>DIO24</name>
              <description>[24:24] Toggles bit 24</description>
              <bitWidth>1</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>DIO23</name>
              <description>[23:23] Toggles bit 23</description>
              <bitWidth>1</bitWidth>
              <bitOffset>23</bitOffset>
            </field>
            <field>
              <name>DIO22</name>
              <description>[22:22] Toggles bit 22</description>
              <bitWidth>1</bitWidth>
              <bitOffset>22</bitOffset>
            </field>
            <field>
              <name>DIO21</name>
              <description>[21:21] Toggles bit 21</description>
              <bitWidth>1</bitWidth>
              <bitOffset>21</bitOffset>
            </field>
            <field>
              <name>DIO20</name>
              <description>[20:20] Toggles bit 20</description>
              <bitWidth>1</bitWidth>
              <bitOffset>20</bitOffset>
            </field>
            <field>
              <name>DIO19</name>
              <description>[19:19] Toggles bit 19</description>
              <bitWidth>1</bitWidth>
              <bitOffset>19</bitOffset>
            </field>
            <field>
              <name>DIO18</name>
              <description>[18:18] Toggles bit 18</description>
              <bitWidth>1</bitWidth>
              <bitOffset>18</bitOffset>
            </field>
            <field>
              <name>DIO17</name>
              <description>[17:17] Toggles bit 17</description>
              <bitWidth>1</bitWidth>
              <bitOffset>17</bitOffset>
            </field>
            <field>
              <name>DIO16</name>
              <description>[16:16] Toggles bit 16</description>
              <bitWidth>1</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>DIO15</name>
              <description>[15:15] Toggles bit 15</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
            <field>
              <name>DIO14</name>
              <description>[14:14] Toggles bit 14</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>DIO13</name>
              <description>[13:13] Toggles bit 13</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>DIO12</name>
              <description>[12:12] Toggles bit 12</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>DIO11</name>
              <description>[11:11] Toggles bit 11</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>DIO10</name>
              <description>[10:10] Toggles bit 10</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>DIO9</name>
              <description>[9:9] Toggles bit 9</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>DIO8</name>
              <description>[8:8] Toggles bit 8</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>DIO7</name>
              <description>[7:7] Toggles bit 7</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>DIO6</name>
              <description>[6:6] Toggles bit 6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>DIO5</name>
              <description>[5:5] Toggles bit 5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>DIO4</name>
              <description>[4:4] Toggles bit 4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>DIO3</name>
              <description>[3:3] Toggles bit 3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>DIO2</name>
              <description>[2:2] Toggles bit 2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>DIO1</name>
              <description>[1:1] Toggles bit 1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>DIO0</name>
              <description>[0:0] Toggles bit 0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>DIN31_0</name>
          <addressOffset>0xc0</addressOffset>
          <size>32</size>
          <description>Data Input from DIO 0 to 31</description>
          <fields>
            <field>
              <name>DIO31</name>
              <description>[31:31] Data input from DIO 31</description>
              <bitWidth>1</bitWidth>
              <bitOffset>31</bitOffset>
            </field>
            <field>
              <name>DIO30</name>
              <description>[30:30] Data input from DIO 30</description>
              <bitWidth>1</bitWidth>
              <bitOffset>30</bitOffset>
            </field>
            <field>
              <name>DIO29</name>
              <description>[29:29] Data input from DIO 29</description>
              <bitWidth>1</bitWidth>
              <bitOffset>29</bitOffset>
            </field>
            <field>
              <name>DIO28</name>
              <description>[28:28] Data input from DIO 28</description>
              <bitWidth>1</bitWidth>
              <bitOffset>28</bitOffset>
            </field>
            <field>
              <name>DIO27</name>
              <description>[27:27] Data input from DIO 27</description>
              <bitWidth>1</bitWidth>
              <bitOffset>27</bitOffset>
            </field>
            <field>
              <name>DIO26</name>
              <description>[26:26] Data input from DIO 26</description>
              <bitWidth>1</bitWidth>
              <bitOffset>26</bitOffset>
            </field>
            <field>
              <name>DIO25</name>
              <description>[25:25] Data input from DIO 25</description>
              <bitWidth>1</bitWidth>
              <bitOffset>25</bitOffset>
            </field>
            <field>
              <name>DIO24</name>
              <description>[24:24] Data input from DIO 24</description>
              <bitWidth>1</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>DIO23</name>
              <description>[23:23] Data input from DIO 23</description>
              <bitWidth>1</bitWidth>
              <bitOffset>23</bitOffset>
            </field>
            <field>
              <name>DIO22</name>
              <description>[22:22] Data input from DIO 22</description>
              <bitWidth>1</bitWidth>
              <bitOffset>22</bitOffset>
            </field>
            <field>
              <name>DIO21</name>
              <description>[21:21] Data input from DIO 21</description>
              <bitWidth>1</bitWidth>
              <bitOffset>21</bitOffset>
            </field>
            <field>
              <name>DIO20</name>
              <description>[20:20] Data input from DIO 20</description>
              <bitWidth>1</bitWidth>
              <bitOffset>20</bitOffset>
            </field>
            <field>
              <name>DIO19</name>
              <description>[19:19] Data input from DIO 19</description>
              <bitWidth>1</bitWidth>
              <bitOffset>19</bitOffset>
            </field>
            <field>
              <name>DIO18</name>
              <description>[18:18] Data input from DIO 18</description>
              <bitWidth>1</bitWidth>
              <bitOffset>18</bitOffset>
            </field>
            <field>
              <name>DIO17</name>
              <description>[17:17] Data input from DIO 17</description>
              <bitWidth>1</bitWidth>
              <bitOffset>17</bitOffset>
            </field>
            <field>
              <name>DIO16</name>
              <description>[16:16] Data input from DIO 16</description>
              <bitWidth>1</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>DIO15</name>
              <description>[15:15] Data input from DIO 15</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
            <field>
              <name>DIO14</name>
              <description>[14:14] Data input from DIO 14</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>DIO13</name>
              <description>[13:13] Data input from DIO 13</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>DIO12</name>
              <description>[12:12] Data input from DIO 12</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>DIO11</name>
              <description>[11:11] Data input from DIO 11</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>DIO10</name>
              <description>[10:10] Data input from DIO 10</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>DIO9</name>
              <description>[9:9] Data input from DIO 9</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>DIO8</name>
              <description>[8:8] Data input from DIO 8</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>DIO7</name>
              <description>[7:7] Data input from DIO 7</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>DIO6</name>
              <description>[6:6] Data input from DIO 6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>DIO5</name>
              <description>[5:5] Data input from DIO 5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>DIO4</name>
              <description>[4:4] Data input from DIO 4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>DIO3</name>
              <description>[3:3] Data input from DIO 3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>DIO2</name>
              <description>[2:2] Data input from DIO 2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>DIO1</name>
              <description>[1:1] Data input from DIO 1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>DIO0</name>
              <description>[0:0] Data input from DIO 0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
