seanmlyons22/ti-lprf-pacs/svds/cc13x2_cc26x2.svd
        <register>
          <name>PDSTAT1VIMS</name>
          <addressOffset>0x1a4</addressOffset>
          <size>32</size>
          <description>VIMS Mode Direct Read Status</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>ON</name>
              <description>[0:0] This is an alias for PDSTAT1.VIMS_ON</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>RFCBITS</name>
          <addressOffset>0x1cc</addressOffset>
          <size>32</size>
          <description>Control To RFC</description>
          <fields>
            <field>
              <name>READ</name>
              <description>[31:0] Control bits for RFC. The RF core CPE processor will automatically check this register when it boots, and it can be used to immediately instruct CPE to perform some tasks at its start-up. The supported functionality is ROM-defined and may vary. See the technical reference manual for more details.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RFCMODESEL</name>
          <addressOffset>0x1d0</addressOffset>
          <size>32</size>
          <description>Selected RFC Mode</description>
          <fields>
            <field>
              <name>RESERVED3</name>
              <description>[31:3] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>29</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>CURR</name>
              <description>[2:0] Selects the set of commands that the RFC will accept. Only modes permitted by RFCMODEHWOPT.AVAIL are writeable. See the technical reference manual for details.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MODE7</name>
                  <value>7</value>
                  <description>Select Mode 7</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE6</name>
                  <value>6</value>
                  <description>Select Mode 6</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE5</name>
                  <value>5</value>
                  <description>Select Mode 5</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE4</name>
                  <value>4</value>
                  <description>Select Mode 4</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE3</name>
                  <value>3</value>
                  <description>Select Mode 3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE2</name>
                  <value>2</value>
                  <description>Select Mode 2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE1</name>
                  <value>1</value>
                  <description>Select Mode 1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE0</name>
                  <value>0</value>
                  <description>Select Mode 0</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RFCMODEHWOPT</name>
          <addressOffset>0x1d4</addressOffset>
          <size>32</size>
          <description>Allowed RFC Modes</description>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>AVAIL</name>
              <description>[7:0] Permitted RFC modes. More than one mode can be permitted.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MODE7</name>
                  <value>128</value>
                  <description>Mode 7 permitted</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE6</name>
                  <value>64</value>
                  <description>Mode 6 permitted</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE5</name>
                  <value>32</value>
                  <description>Mode 5 permitted</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE4</name>
                  <value>16</value>
                  <description>Mode 4 permitted</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE3</name>
                  <value>8</value>
                  <description>Mode 3 permitted</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE2</name>
                  <value>4</value>
                  <description>Mode 2 permitted</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE1</name>
                  <value>2</value>
                  <description>Mode 1 permitted</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE0</name>
                  <value>1</value>
                  <description>Mode 0 permitted</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PWRPROFSTAT</name>
          <addressOffset>0x1e0</addressOffset>
          <size>32</size>
          <description>Power Profiler Register</description>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>VALUE</name>
              <description>[7:0] SW can use these bits to timestamp the application. These bits are also available through the testtap and can thus be used by the emulator to profile in real time.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>MCUSRAMCFG</name>
          <addressOffset>0x21c</addressOffset>
          <size>32</size>
          <description>MCU SRAM configuration</description>
          <fields>
            <field>
              <name>RESERVED6</name>
              <description>[31:6] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>26</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>BM_OFF</name>
              <description>[5:5] Burst Mode disable

